Тест/Тест/src/Catalogs/ВлиянияРасходы/ВлиянияРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВлиянияРасходы</name>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВидыРасходов_3/ВидыРасходов_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов_3</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влияние</name>
    <type>
      <types>CatalogRef.ВлиянияРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ОргСтруктураРасходы</name>
    <type>
      <types>CatalogRef.ОргСтруктураРасходы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВлияние</name>
    <attributes>
      <name>Влияние</name>
      <type>
        <types>CatalogRef.ВлиянияРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВлиянияРасходы/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокОтделовПриАктивизацииСтроки(Элемент)
		Если Элементы.СписокОтделов.ТекущиеДанные <> Неопределено Тогда
		
			ТекДанные = Элементы.СписокОтделов.ТекущиеДанные; 
			Список3.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Отдел);

		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список3.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	ЗаполнитьПодвалы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки(Команда)
	ОбновитьСпискиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиНаСервере()
	
	Элементы.Список3.Обновить();
	Элементы.СписокОтделов.Обновить();
	ЗаполнитьПодвалы();
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокОтделовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
		СсылкаНаОбъект = Элементы.СписокОтделов.ТекущиеДанные.Отдел;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВидыРасходов_3.ФормаОбъекта", ПараметрыФормы)	
		
	

КонецПроцедуры

&НаКлиенте
Процедура Список3Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СсылкаНаОбъект = Элементы.Список3.ТекущиеДанные.Влияние;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВлиянияРасходы.Форма.ФормаЭлемента", ПараметрыФормы)	
КонецПроцедуры


Процедура ЗаполнитьПодвалы()
	ЗаполнитьПодвалСписокОтделов();
	ЗаполнитьПодвалСписок3();	
	ЗаполнитьПодвалСписок();
КонецПроцедуры

Процедура ЗаполнитьПодвалСписокОтделов()
	
	Схема = Элементы.СписокОтделов.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокОтделов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовКоличество.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовПлан.ТекстПодвала =  Формат(Результат.Итог("План"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовКоличество.ТекстПодвала =  Формат(Результат.Итог("Количество"),"ЧДЦ=0; ЧН=-");

КонецПроцедуры

Процедура ЗаполнитьПодвалСписок3()
	
	Схема = Элементы.Список3.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список3.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.Список3План.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.Список3План.ТекстПодвала =  Формат(Результат.Итог("План"),"ЧДЦ=0; ЧН=-");

КонецПроцедуры

Процедура ЗаполнитьПодвалСписок()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.КолОтделов.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокПлан.ТекстПодвала =  Формат(Результат.Итог("План"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.КолОтделов.ТекстПодвала =  Формат(Результат.Итог("КолОтделов"),"ЧДЦ=0; ЧН=-");

КонецПроцедуры
